Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: There are accessor methods for getting and setting document attributes, methods for transforming documents using XSLT, a method for dynamically validating a document, and methods for printing out the content of an XMLDocument as XML, XHTML, HTML, or plain text.
ja: 書類属性を取得及び設定するためのアクセッサメソッド、XSLTを使った文書変形のためのメソッド、動的に文書を検証するためのメソッド、そしてXMLDocumentの内容をXML、XHTML、HTML、またはプレーンテキストとして出力するためのメソッドがあります。

source: There are three gesture composition types:
ja: ３つのジェスチャ合成型があります：

source: Therefore, options is emptied and the intersection between .express and options is returned.
ja: したがって、optionsは空にされて.expressとoptionsの間の交叉が返されます。

source: Therefore, a font(_:) modifier that you apply to the stack has no effect on the stack itself.
ja: それゆえ、あなたがスタックに適用するfont(_:)修飾子は、スタックそれ自身に影響を及ぼしません。

source: These constants are input and output options for all NSXMLNode objects (unless otherwise indicated), including XMLDocument objects.
ja: これらの定数は、全てのNSXMLNodeオブジェクトに対する入力および出力オプションです（特に断りのない限り）、XMLDocumentオブジェクトを含めて。

source: These constants are returned as the value for a NSKeyValueChangeKindKey key in the change dictionary passed to observeValueForKeyPath:ofObject:change:context: indicating the type of change made.
ja: これらの定数は、NSKeyValueChangeKindKeyキーに対する値として、observeValueForKeyPath:ofObject:change:context:に渡される変更辞書において返されて、なされた変更の型を指し示しています。

source: These constants are returned as the value for a kindKey key in the change dictionary passed to observeValue(forKeyPath:of:change:context:) indicating the type of change made.
ja: これらの定数は、kindKeyキーに対する値として、observeValue(forKeyPath:of:change:context:)に渡される変更辞書において返されて、なされた変更の型を指し示しています。

source: These constants are used as keys in the change dictionary passed to observeValue(forKeyPath:of:change:context:).
ja: これら定数は、observeValue(forKeyPath:of:change:context:)に渡される変更辞書においてキーとして使われます。

source: These constants are used as keys in the change dictionary passed to observeValueForKeyPath:ofObject:change:context:.
ja: これら定数は、observeValueForKeyPath:ofObject:change:context:に渡される変更辞書においてキーとして使われます。

source: These constants are used by the NSString method applyingTransform(_:reverse:).
ja: これら定数は、NSStringのメソッドapplyingTransform(_:reverse:)によって使われます。

source: These constants define the available array operators.
ja: これら定数は、利用可能な配列演算子を定義します。

source: These constants define the names of exceptions raised if NSString cannot represent a string in a given encoding, or parse a string as a property list.
ja: これらの定数は、NSStringが文字列をある与えられた符号化で表せない、または文字列をプロパティリストであると構文解析するならば引き起こされる例外の名前を定義します。

source: These constants specify the values that are returned by terminationReason.
ja: これら定数は、terminationReasonによって返される値を指定します。

source: These counters can be used as indices only in instances of zero-based, integer-indexed collections, such as Array and ContiguousArray.
ja: これらのカウンタはインデックスとして使われることが、ゼロ基盤の、整数インデックスでのコレクション、例えばArrayそしてContiguousArrayなどのインスタンスにおいてのみ可能です。

source: These keys may exist in the user info dictionary.
ja: これらのキーがユーザ情報辞書に存在するかもしれません。

source: These methods handle the drop using a closure you provide as part of the modifier.
ja: これらメソッドは、ドロップをあなたが提供するクロージャを使って修飾子の一部として取り扱います。

source: These precautions do not apply, of course, if you are creating an XML tree programmatically.
ja: これら予防措置は当てはまりません、もちろん、あなたがXMLツリーをプログラム的に作成しているならば。

source: They themselves cannot have any children.
ja: それらはそれら自身では何ら子を持てません。

source: This NSString object.
ja: このNSStringオブジェクト。

source: This also applies to the interpolated newline placed in the middle of the text since “multiple lines” refers to all of the text inside the view, regardless of any internal formatting or inclusion of interpolated text.
ja: これはまたこのテキストの真ん中に置かれた補間改行も適用します、“複数行” はビュー内のテキストの全てを言うからです、なんらかの内部的書式設定または含まれる補間テキストがあろうとも。

source: This can be useful when using a PreviewProvider to see how a view represents different values.
ja: これは、PreviewProviderを使っている時にどのくらいビューが異なる値を表すか知るのに有用でありえます。

source: This can happen, for example, if the view is inside a container that respects the screen’s safe area.
ja: これは起こりえます、例えば、そのビューが画面のもつ安全領域を尊重するコンテナ内ならば。

source: This can result in the view exceeding the parent’s bounds, which may or may not be the effect you want.
ja: これは、ビューがその親のもつ境界を越えるという結果になりえます、それはあなたが望む効果であるかもしれないしないかもしれません。

source: This change can occur when observing an attribute of an object, as well as properties that specify to-one and to-many relationships.
ja: この変更は、オブジェクトの属性を監視している時に発生する可能性があります、対一および対多関係を指定するプロパティだけでなく。

source: This color space is gamma corrected.
ja: この色空間は、ガンマ補正されます。

source: This color space isn’t gamma corrected.
ja: この色空間は、ガンマ補正されません。

source: This documentation comment was inherited from AdditiveArithmetic.
ja: この文書化コメントは、AdditiveArithmeticから引き継がれました。

source: This documentation comment was inherited from BidirectionalCollection.
ja: この文書化コメントは、BidirectionalCollectionから引き継がれました。

source: This documentation comment was inherited from ExpressibleByExtendedGraphemeClusterLiteral.
ja: この文書化コメントは、ExpressibleByExtendedGraphemeClusterLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByUnicodeScalarLiteral.
ja: この文書化コメントは、ExpressibleByUnicodeScalarLiteralから引き継がれました。

source: This documentation comment was inherited from Sequence.
ja: この文書化コメントは、Sequenceから引き継がれました。

source: This ensures that properties have valid values before body uses them.
ja: これは、プロパティが有効な値を持つことをbodyがそれらを使う前に確実にします。

source: This example checks to see whether a favorite actor is in an array storing a movie’s cast.
ja: この例は、お気に入りの俳優が映画出演者を格納する配列の中にいるかどうか見るために調べます。

source: This example creates a ClosedRange<Character> from “a” up to, and including, “z”.
ja: この例は、「a」から「z」までの、そしてそれを含むClosedRange<Character>を作成します。

source: This example creates a PartialRangeFrom<Double> instance that includes any value greater than or equal to 5.0.
ja: この例は、PartialRangeFrom<Double>インスタンスで5.0より大きいか等しい何らかの値を含むものを作成します。

source: This example creates a PartialRangeThrough<Double> instance that includes any value less than or equal to 5.0.
ja: この例は、PartialRangeThrough<Double>インスタンスで5.0より少ないか等しい何らかの値を含むものを作成します。

source: This example creates a PartialRangeUpTo<Double> instance that includes any value less than 5.0.
ja: この例は、PartialRangeUpTo<Double>インスタンスで5.0より少ない何らかの値を含むものを作成します。

source: This example creates a Range<Double> from zero up to, but not including, 5.0.
ja: この例は、ゼロから5.0までの、しかしそれを含めないRange<Double>を作成します。

source: This example demonstrates getting a slice of an array of strings, finding the index of one of the strings in the slice, and then using that index in the original array.
ja: この例は文字列からなる配列のあるスライスの取得を実演します、スライスの中の文字列の１つのインデックスを見つけて、それからそのインデックスを元の配列において使います。

source: This example enumerates the characters of the string “Swift” and prints each character along with its place in the string.
ja: この例は文字列「Swift」の文字を列挙します、そして各文字をその文字列でのそれの場所とともに出力します。

source: This example finds the index of the last name that begins with the letter A:
ja: この例は、表音文字A:で始まるラストネームのインデックスを見つけます：

source: This example finds the largest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も大きな値を見つけます。

source: This example finds the smallest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も小さい値を見つけます。

source: This example iterates over the indices and elements of a set, building a list consisting of indices of names with five or fewer letters.
ja: この例は、ある集合のインデックスと要素のすべてにわたって反復します、５つまたはより少ない文字を持つ名前のインデックスから成るリストを作ります。

source: This example picks a name at random from an array:
ja: この例は、ある名前を無作為に配列から選び出します：

source: This example prints the characters of a string in reverse order:
ja: この例は、ある文字列に属する文字を逆順で出力します。

source: This example searches streetsSlice for one of the strings in the slice, and then uses that index in the original array.
ja: この例は、streetsSliceをスライスの中の文字列の１つについて検索して、それからそのインデックスを元々の配列において使います。。

source: This example shows how an array of [Int] instances can be joined, using another [Int] instance as the separator:
ja: この例は、どのようにいくつかのの[Int]インスタンスからなる配列が別の[Int]インスタンスを分離子として使ってつなぎ合わされるかを示します。

source: This example shows how to build a dictionary of letter frequencies of a string.
ja: この例は、ある文字列の文字頻度の辞書を作り上げる方法を示します。

source: This example shows how to find the sum of an array of numbers.
ja: この例は、どのように数からなる配列の合計を見出すかを示します。

source: This example shows how to use the max(by:) method on a dictionary to find the key-value pair with the highest value.
ja: この例は、max(by:)メソッドを辞書上で使って、最も高い値を持つキー値ペアを見つける方法を示します。

source: This example shows how to use the min(by:) method on a dictionary to find the key-value pair with the lowest value.
ja: この例は、min(by:)メソッドを辞書上で使って、最も低い値を持つキー値ペアを見つける方法を示します。

source: This example shows how you can check an array for an expense greater than $100.
ja: この例は、どのようにあなたが$100より大きい出費についてある配列を調べることができるかを示します。

source: This example shows how you can modify one of the names in an array of students.
ja: この例が示すのは、どうやってあなたが学生らの配列の中の名前の１つを修正できるかです。

source: This example shows the effect of fixedSize() on a text view that is wider than its parent, preserving the ideal, untruncated width of the text view.
ja: この例は、fixedSize()の効果をそれの親より広いあるテキストビュー上で示します、その最適な、切りつめないテキストビューの幅を保全しています。

source: This example shows the effect of fixedSize(horizontal:vertical:) on a text view that is wider than its parent, preserving the ideal, untruncated width of the text view.
ja: この例は、fixedSize(horizontal:vertical:)の効果をそれの親より広いあるテキストビュー上で示します、その最適な、切りつめないテキストビューの幅を保全しています。

source: This example tests whether one countable range begins with the elements of another countable range.
ja: この例は、ある可付番範囲が別の可付番範囲の要素で始まるかどうかテストします。

source: This example tests whether one countable range shares the same elements as another countable range and an array.
ja: この例は、ある可付番範囲が同じ要素を別の可付番範囲とそしてある配列と共有するかどうかをテストします。

source: This example uses the contains(_:) method to check whether next-day shipping is in the availableOptions instance.
ja: この例は、contains(_:)メソッドを使って翌日出荷がavailableOptionsインスタンスの中のあるかどうか確認します。

source: This example uses the intersection(_:) method to limit the available shipping options to what can be used with a PO Box destination.
ja: この例は、intersection(_:)メソッドを使って、利用可能な出荷オプションを私書箱宛先で使われるものに制限します。

source: This example uses the last(where:) method to find the last negative number in an array of integers:
ja: この例は、last(where:)メソッドを使って、整数からなるある配列の中の最後の負数を見つけます：

source: This example uses the lexicographicallyPrecedes method to test which array of integers comes first in a lexicographical ordering.
ja: この例はlexicographicallyPrecedesメソッドを使って、どの整数配列がある語彙筆記的順序において最初に来るかをテストします。

source: This example uses the union(_:) method to add two more shipping options to the default set.
ja: この例は、union(_:)メソッドを使って２つのさらなる出荷オプションを省略時のセットに加えます。

source: This feature turns capital characters into small capitals.
ja: この機能は、キャピタル文字をスモールキャピタルへと転換します。

source: This function behaves like fixedSize(), except with fixedSize(horizontal:vertical:) the fixing of the axes can be optionally specified in one or both dimensions.
ja: この関数はfixedSize()のように振る舞います、fixedSize(horizontal:vertical:)では軸を治すのは１つまたは両方の次元において指定できるのを除いて。

source: This function does not infer element moves.
ja: この関数は、要素の移動を推論しません。

source: This function is only valid during the performDrop() action.
ja: この関数は、performDrop()アクションの間に有効なだけです。

source: This function is the only requirement of the Comparable protocol.
ja: この関数は、Comparableプロトコルの唯一の要件です。

source: This function sets the given Animation as the animation property of the thread’s current Transaction.
ja: この関数は、与えられたAnimationをスレッドの現在のTransactionのanimationプロパティとして設定します。

source: This function turns lowercase characters into small capitals for the font.
ja: この関数は、ローワケース文字をそのフォントのスモールキャピタルへと転換します。

source: This gesture has precedence over the other gesture.
ja: このジェスチャは、他のジェスチャを越える優先度を持ちます。

source: This gradient applies the color function as the angle changes, relative to a center point and defined start and end angles.
ja: この勾配（グラデーション）は、色関数を角度変化として適用します、ある中心点に関してそして開始および終了角度を定義されて。

source: This image will be specifically ignored for accessibility purposes.
ja: この画像は、アクセシビリティ目的に対しては明確に無視されるでしょう。

source: This initializer creates a Text view on your behalf, and treats the localized key similar to init(_:tableName:bundle:comment:).
ja: このイニシャライザは、Textビューをあなたに代わって作成します、そしてローカライズされたキーをinit(_:tableName:bundle:comment:)に似たものと見なします。

source: This initializer creates a Text view on your behalf, and treats the title similar to init(_:).
ja: このイニシャライザは、Textビューをあなたの代わりに作成します、そしてタイトルをinit(_:)と同じように扱います。

source: This initializer creates an option set with a raw value of zero.
ja: このイニシャライザは、０個の生の値を持つオプションセットを作成します。

source: This instance only reads the initial value of data and doesn’t need to identify views across updates.
ja: このインスタンスは、dataの初期値を読み出すだけで、ビューそれらを更新を越えて確認する必要はありません。

source: This is equivalent to location.{x,y} - startLocation.{x,y}.
ja: これは、location.{x,y} - startLocation.{x,y}に等しいです。

source: This is equivalent to `location.{x,y} - startLocation.{x,y}`.
ja: これは、`location.{x,y} - startLocation.{x,y}` に等しいです。

source: This is the default implementation of the equal-to operator (==) for any type that conforms to Equatable.
ja: これは、Equatableに準拠するあらゆる型に対して、同等演算子（==）の省略時の実装です。

source: This is the default implementation of the greater-than operator (>) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対してのより大きい演算子（>）の初期状態の実装です。

source: This is the default implementation of the greater-than-or-equal-to operator (>=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より大きいか等しい演算子（>=）の初期状態の実装です。

source: This is the default implementation of the less-than-or-equal-to operator (<=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対しての、より少ないか等しい演算子（<=）の初期状態の実装です。

source: This is the default implementation of the not-equal-to operator (!=) for any type that conforms to Equatable.
ja: これは、Equatableに準拠するあらゆる型に対して、不等演算子（!=）の省略時の実装です。

source: This is useful for custom button styles that modify the current button style, rather than implementing a brand new style.
ja: これは、現在のボタンスタイルを修正するあつらえのボタンスタイルに役立ちます、真新しいスタイルを実装するよりむしろ。

source: This limits the scope of the opacity change to the outermost view.
ja: これは、不透明度変更の作用範囲を一番外側のビューに制限します。

source: This means that reduce(value: &x, nextValue: {defaultValue}) shouldn’t change the meaning of x.
ja: これが意味するのは、reduce(value: &x, nextValue: {defaultValue})はxの意味を変更すべきでないということです。

source: This method implements the mathematical notion of lexicographical ordering, which has no connection to Unicode.
ja: このメソッドは、語彙筆記的順序の数学的概念を実装します、それはユニコードに関係はありません。

source: This method is equivalent to calling aspectRatio(nil, contentMode: .fill).
ja: このメソッドは、aspectRatio(nil, contentMode: .fill)を呼び出すことに等しいです。

source: This method is equivalent to calling aspectRatio(nil, contentMode: .fit).
ja: このメソッドは、aspectRatio(nil, contentMode: .fit)を呼び出すことに等しいです。

source: This method is equivalent to calling randomElement(using:), passing in the system’s default random generator.
ja: このメソッドは、randomElement(using:)を呼び出して、システムのもつ省略時のランダム生成子を渡すことと等しいです。

source: This method is equivalent to calling shuffled(using:), passing in the system’s default random generator.
ja: このメソッドは、shuffled(using:)を呼び出して、システムのもつ省略時の無作為生成子を渡すことと等しいです。

source: This method is implemented as a & (bitwise AND) operation on the two sets’ raw values.
ja: このメソッドは、２つの集合の持つ生の値に関する&（ビット単位AND）演算として実装されます。

source: This method is implemented as a ^ (bitwise XOR) operation on the two sets’ raw values.
ja: このメソッドは、２つの集合の持つ生の値に関する^（ビット単位XOR）演算として実装されます。

source: This method is implemented as a | (bitwise OR) operation on the two sets’ raw values.
ja: このメソッドは、２つの集合の持つ生の値に関する|（ビット単位OR）演算として実装されます。

source: This method is preferred over reduce(_:_:) for efficiency when the result is a copy-on-write type, for example an Array or a Dictionary.
ja: このメソッドは、効率のためにreduce(_:_:)より好まれます、その結果がコピーオンライト型である場合、例えばArrayまたは辞書に対しては。

source: This method receives its values in view-tree order.
ja: このメソッドは、それの値それらをビューツリーの順番で受け取ります。

source: This method sets the geometry of each view in the group from the inserted view with isSource = true (known as the “source” view), updating the values marked by properties.
ja: このメソッドは、グループの中の各ビューの幾何学を、isSource = trueの状態で挿入されたビュー（“ソース” ビューとして知られるもの）から設定します、propertiesによって印された値を更新して。

source: This modifier allows for the contextual menu to be conditionally available by passing nil as the value for contextMenu.
ja: この修飾子は、そのコンテキストによるメニューが条件付きで利用可能であることに、nilをcontextMenuに対する値として渡すことによって対応しています。

source: This modifier only takes effect when this view is inside of and visible within a NavigationView.
ja: この修飾子は、このビューがNavigationViewの内側であるそしてその内部で可視である場合に有効であるだけです。

source: This notification can be posted either when the task has exited normally or as a result of terminate() being sent to the NSTask object.
ja: この通知は、タスクが通常通りに退出した時またはNSTaskオブジェクトに送られるterminate()の結果としてのどちらでも投函されることができます。

source: This pattern extends to most other container views in SwiftUI that have customizable, interactive content, like forms (instances of Form).
ja: このパターンは、カスタマイズ可能な、対話型の内容を持つ、SwiftUIにおけるほとんどの他のコンテナビューに及びます、フォーム（Formのインスタンス）のような。

source: This property provides primary access to the value’s data.
ja: このプロパティは、値のもつデータに対する主要なアクセスを提供します。

source: This property returns an empty array when there are no fetched results.
ja: このプロパティは、フェッチした結果がない場合は空の配列を返します。

source: This ranges from -20% contrast (yielding inverted colors — turning the red square to pale-green and the green circle to mauve), to neutral-gray at 0%, to 100% contrast (bright-red square / bright-green circle).
ja: これは、-20%のコントラスト（逆にされた色を生成している — 赤い正方形を薄い緑へそして緑の円を藤色へ変えている）から、0%での中間灰色に、100%コントラスト（明るい赤の正方形／明るい緑の円）に及びます。

source: This retrieves a binding of the state property from its projectedValue property.
ja: これは、状態プロパティのバインディングをそれのprojectedValueプロパティから取ってきます。

source: This sample code project is associated with WWDC 2019 session 237: Building Custom Views in SwiftUI.
ja: このサンプルコードプロジェクトは、WWDC 2019セッション237: Building Custom Views in SwiftUIと関連します。

source: This sample code project is associated with WWDC 2019 session 238: Accessibility in SwiftUI.
ja: このサンプルコードプロジェクトは、WWDC 2019セッション238: Accessibility in SwiftUIと関連します。

source: This should only be provided when the file is in targets that support multiple platforms.
ja: これは、複数のプラットホームをサポートするターゲットの中にファイルがある場合に提供されるだけであるべきです。

source: This string is visible during user customization.
ja: この文字列は、ユーザカスタマイゼーションの間に見られます。

source: This transformer isn't reversible because it doesn't make sense to transform a class name into an object.
ja: この変換器は、可逆ではありません、なぜならそれはクラス名をオブジェクトへと変換することを理解できないからです。

source: This tutorial gives you a chance to apply much of what you’ve already learned about SwiftUI, and — with little effort — migrate the Landmarks app to watchOS.
ja: このチュートリアルは、あなたが既にSwiftUIについて学んでいることの多くを適用する機会をあなたに与えます、そして — 少しの努力で — LandmarksアプリをwatchOSへと移行します。

source: This tutorial guides you through building Landmarks — an iOS app for discovering and sharing the places you love.
ja: この指導書は、あなたにLandmarks — あなたのお気に入りの場所を発見および共有するためのiOSアプリを構築する案内をします。

source: This tutorial takes you through the process of creating a badge by combining paths and shapes, which you then overlay with another shape that represents the location.
ja: このチュートリアルは、あなたにバッジ作成の過程をパスと形状を組み合わせることで手取り足取り指導します、それはあなたがそれから場所を表す別の形状をかぶせるものです。

source: This type is suitable for use as the animatableData property of types that do not have any animatable properties.
ja: この型は、どんなアニメーション可能プロパティも持たない型のanimatableDataプロパティとして使うのに適します。

source: This value is nil when the environment represents a context that doesn’t support undo and redo operations.
ja: この値はnilです、環境が取り消しおよびやり直しをサポートしないある前後関係を表す場合は。

source: This value is true during the initial phase of a two-part transition update, to prevent animation(_:) from inserting new animations into the transaction.
ja: この値は、ある２部分遷移の初期段階が更新する間はtrueです、animation(_:)を新しいアニメーションをその遷移に挿入することを防ぐために。

source: This value is true if a continuous action created the transaction, and is false otherwise.
ja: この値はtrueです、もしある連続したアクションがトランザクションを作成したならば、そうでなければfalse。

source: This value is a fraction between 0 and 1 (inclusive).
ja: この値は、0と1（を含めて）の間の小数です。

source: This value is equal to 1 divided by displayScale.
ja: この値は、1をdisplayScaleで割ったものに等しいです。

source: This value must be greater than 0.0 and less than or equal to 1.0.
ja: この値は、0.0より大きくそして1.0より少ないか等しくなければなりません。

source: This value must be in the range [0, 1].
ja: この値は、範囲[0, 1]の中になければなりません。

source: This value reflects the value of the Bold Text display setting found in the Accessibility settings.
ja: この値は、「Accessibility」設定において見つけられる「Bold Text」表示設定の値を反映します。

source: This view returns a flexible preferred size to its parent layout.
ja: このビューは、それの親レイアウトに対して、柔軟な好ましい大きさを返します。

source: This view’s aspect ratio is maintained as the view scales.
ja: このビューのもつアスペクト比は、ビューの縮尺どおりに保たれます。

source: Thss value is equal to 1 / displayScale.
ja: この値は1 / displayScaleに等しいです。

source: To access a state’s underlying value, use its variable name, which returns the wrappedValue property value.
ja: ある状態のもつ基礎をなす値にアクセスするには、それの変数名を使ってください、それはwrappedValueプロパティ値を返します。

source: To add a custom appearance with standard interaction behavior, create a style that conforms to the ButtonStyle protocol.
ja: あつらえの外観を標準相互作用挙動で加えるには、ButtonStyleプロトコルに準拠するあるスタイルを作成してください。

source: To add your interface object into your SwiftUI interface, create your UIViewRepresentable instance and add it to your SwiftUI interface.
ja: あなたのインターフェイスオブジェクトをあなたのSwiftUIインターフェイスに加えるには、あなたのUIViewRepresentableインスタンスを作成して、それをあなたのSwiftUIインターフェイスに加えてください。

source: To add your view controller into your SwiftUI interface, create your NSViewControllerRepresentable instance and add it to your SwiftUI interface.
ja: あなたのビューコントローラをあなたのSwiftUIインターフェイスに加えるには、あなたのNSViewControllerRepresentableインスタンスを作成して、それをあなたのSwiftUIインターフェイスに加えてください。

source: To add your view controller into your SwiftUI interface, create your UIViewControllerRepresentable instance and add it to your SwiftUI interface.
ja: あなたのビューコントローラをあなたのSwiftUIインターフェイスに加えるには、あなたのUIViewControllerRepresentableインスタンスを作成して、それをあなたのSwiftUIインターフェイスに加えてください。

source: To add your view into your SwiftUI interface, create your NSViewRepresentable instance and add it to your SwiftUI interface.
ja: あなたのビューをあなたのSwiftUIインターフェイスに加えるには、あなたのNSViewRepresentableインスタンスを作成して、それをあなたのSwiftUIインターフェイスに加えてください。

source: To add your view into your SwiftUI interface, create your UIViewRepresentable instance and add it to your SwiftUI interface.
ja: あなたのビューをあなたのSwiftUIインターフェイスに加えるには、あなたのUIViewRepresentableインスタンスを作成して、それをあなたのSwiftUIインターフェイスに加えてください。

source: To apply a different style to a toggle, or to a view that contains toggles, use the toggleStyle(_:) modifier.
ja: 異なるスタイルをあるトグルに、またはトグルを含むビューに適用するには、toggleStyle(_:)修飾子を使ってください。

source: To apply the default style to a button, or to a view that contains buttons, use the buttonStyle(_:) modifier.
ja: 省略時のスタイルをボタンに、またはボタンを含むビューに適用するには、buttonStyle(_:)修飾子を使ってください。

source: To apply the default style to a picker, or to a view that contains pickers, use the pickerStyle(_:) modifier.
ja: 省略時のスタイルをあるピッカーに、またはピッカーそれらを含むあるビューに適用するには、pickerStyle(_:)修飾子を使ってください。

source: To apply this style to a button, or to a view that contains buttons, use the buttonStyle(_:) modifier.
ja: このスタイルをボタンに、またはボタンを含むビューに適用するには、buttonStyle(_:)修飾子を使ってください。

source: To check whether a collection is empty, use its isEmpty property instead of comparing count to zero.
ja: あるコレクションが空かどうか調べるには、それのisEmptyプロパティを使ってください、countをゼロと比較するのでなく。

source: To compute views on demand over a dynamic range, use init(_:id:content:).
ja: ビューそれらを必要に応じてある動的範囲にわたって計算するには、init(_:id:content:)を使ってください。

source: To compute views on demand over a dynamic range, use init(_:id:rowContent:).
ja: ビューそれらを必要に応じてある動的範囲にわたって計算するには、init(_:id:rowContent:)を使ってください。
